# 겨울방학 파이썬 스터디 4차시

<font color = "#CC3D3D"><p>

- [Series](#Series)
    - [Series 다루기](#Series-다루기)
- [DataFrame](#DataFrame)
    - [DataFrame 다루기](#DataFrame-다루기)
    - [Column handling](#Column-handling)
    - [Indexing](#Indexing)
        - [열 indexing](#열-indexing)
        - [행 indexing](#행-indexing)
            - [loc, iloc](#loc,-iloc)
            - [boolean indexing](#boolean-indexing)
            - [query](#query)
    - [Merging DataFrame](#Merging-DataFrame)
    - [Concatenating DataFrame](#Concatenating-DataFrame)
    - [Handling Missing Data](#Handling-Missing-Data)
    - [Duplicate Rows](#Duplicate-Rows)
- [Reading and Writing Data](#Reading-and-Writing-Data)
- [Exercise](#Exercise)

# Pandas

In [1]:
import pandas as pd

## Series

In [2]:
obj = pd.Series([4,7,-5,3]) ; obj

0    4
1    7
2   -5
3    3
dtype: int64

### Series 다루기

.values : 값만 따로 확인

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

.index : index 범위값 확인

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

.dtypes : 데이터 타입 확인

In [5]:
obj.dtypes

dtype('int64')

원하는 값으로 인덱스 지정  ( 딕셔너리 형태로도 가능함 )

In [6]:
obj2 = pd.Series([4,7,-5,3], index = ['a','b','c','d']) ; obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [7]:
dic = {'김정하' : 22 , '마민정' : 22 , '이현준' : 22 , '유광열' : 22}
obj3 = pd.Series(dic)   ; obj3

김정하    22
마민정    22
이현준    22
유광열    22
dtype: int64

.name : Series 이름과 index 이름 지정하기

In [8]:
obj3.name = "스터디 멘토"   # Series 이름을 정할때는 시리즈명.name
obj3.index.name = "이름"    # index 이름을 정할때는 시리즈이름.index.name
obj3

이름
김정하    22
마민정    22
이현준    22
유광열    22
Name: 스터디 멘토, dtype: int64

index 값 변경하기

In [9]:
obj3.index = ['정하','민정','현준','광열'] ; obj3

정하    22
민정    22
현준    22
광열    22
Name: 스터디 멘토, dtype: int64

## DataFrame

In [10]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Ohio'],
    'year': [2000, 2001, 2002, 2001, 2002, 2000],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
df = pd.DataFrame(data)  ; df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5    Ohio  2000  3.2

### DataFrame 다루기

.info() : 해당 DataFrame에 대한 대략적인 정보 제공

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   6 non-null      object
 1   year    6 non-null      int64
 2   pop     6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

.columns : 열 이름 확인하기

In [12]:
df.columns

Index(['state', 'year', 'pop'], dtype='object')

.values : 값이 행을 기준으로 리스트 형태로 묶여서 제공

In [13]:
df.values

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9],
       ['Ohio', 2000, 3.2]], dtype=object)

.size : 행의 개수 * 열의 개수

In [14]:
df.size # 6*3

18

.shape : 데이터의 모양을 알려줌

In [15]:
df.shape   # 6개의 행, 3개의 열로 구성되어있다는 의미.

(6, 3)

In [16]:
df.shape[0] # 행의 개수

6

In [17]:
df.shape[1] # 열의 개수

3

In [18]:
len(df) # 이전에 배웠던 len()에 넣으면 데이터프레임의 길이 즉, 행의 개수 출력

6

.describe() : 데이터가 갖고 있는 수치데이터들의 대표적인 통계값

In [19]:
df.describe()  # 데이터 타입이 숫자인 year과 pop에 대한 통계값

              year       pop
count     6.000000  6.000000
mean   2001.000000  2.550000
std       0.894427  0.836062
min    2000.000000  1.500000
25%    2000.250000  1.875000
50%    2001.000000  2.650000
75%    2001.750000  3.125000
max    2002.000000  3.600000

In [20]:
df.describe(percentiles=[.1,.2,.5,.8]) # 백분위 구간 조정

              year       pop
count     6.000000  6.000000
mean   2001.000000  2.550000
std       0.894427  0.836062
min    2000.000000  1.500000
10%    2000.000000  1.600000
20%    2000.000000  1.700000
50%    2001.000000  2.650000
80%    2002.000000  3.200000
max    2002.000000  3.600000

In [21]:
df.describe().astype('int')  # 실수가 아닌 정수 형태로

       year  pop
count     6    6
mean   2001    2
std       0    0
min    2000    1
25%    2000    1
50%    2001    2
75%    2001    3
max    2002    3

.head() : 데이터 최상단에 있는 5개 항목 표시

In [22]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [23]:
df.head(3)   # 최상단에 있는 3개의 항목 표시

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

.tail() : 데이터 최하단에 있는 5개 항목 표시

In [24]:
df.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5    Ohio  2000  3.2

In [25]:
df.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5    Ohio  2000  3.2

.unique() : 해당 열의 고유값을 반환

In [26]:
df['year'].unique()

array([2000, 2001, 2002], dtype=int64)

.nunique() : 해당 열의 고유값의 개수를 반환

In [27]:
df['year'].nunique()

3

.value_counts() : 각 고유값의 출력횟수

In [28]:
df['year'].value_counts()

2002    2
2001    2
2000    2
Name: year, dtype: int64

.sort_values() : 데이터를 순서대로 정렬

In [29]:
df.sort_values(by = 'year')   #year의 값을 기준으로 오름차순 정렬

    state  year  pop
0    Ohio  2000  1.5
5    Ohio  2000  3.2
1    Ohio  2001  1.7
3  Nevada  2001  2.4
2    Ohio  2002  3.6
4  Nevada  2002  2.9

In [30]:
df.sort_values(by = 'year', ascending = False)  # ascending = False 인자를 통해 내림차순 정렬

    state  year  pop
2    Ohio  2002  3.6
4  Nevada  2002  2.9
1    Ohio  2001  1.7
3  Nevada  2001  2.4
0    Ohio  2000  1.5
5    Ohio  2000  3.2

### Column handling

- 새로운 열 추가하기 : data[new_column_name] = [values]

In [31]:
df['num'] = [0,1,0,2,3,5] ; df

    state  year  pop  num
0    Ohio  2000  1.5    0
1    Ohio  2001  1.7    1
2    Ohio  2002  3.6    0
3  Nevada  2001  2.4    2
4  Nevada  2002  2.9    3
5    Ohio  2000  3.2    5

- 새로운 열 추가하기 : Series 이용

In [32]:
num2 = pd.Series([5,6,7], index=[0,2,4])   # index를 이용해 원하는 특정 행에만 값
df['num2'] = num2 ;df      # NaN (결측값 -> 뒤에서 더 자세하게)

    state  year  pop  num  num2
0    Ohio  2000  1.5    0   5.0
1    Ohio  2001  1.7    1   NaN
2    Ohio  2002  3.6    0   6.0
3  Nevada  2001  2.4    2   NaN
4  Nevada  2002  2.9    3   7.0
5    Ohio  2000  3.2    5   NaN

- 열 삭제하기 : del data[column_name]

In [33]:
del df['num2'] ; df

    state  year  pop  num
0    Ohio  2000  1.5    0
1    Ohio  2001  1.7    1
2    Ohio  2002  3.6    0
3  Nevada  2001  2.4    2
4  Nevada  2002  2.9    3
5    Ohio  2000  3.2    5

- 열 삭제하기 : data.drop(column_name, axis = 1, inplace = True)

In [34]:
df.drop( 'num', axis = 1, inplace = True) ; df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5    Ohio  2000  3.2

In [35]:
# inplace = True 인자를 적지 않으면 원본 데이터를 보존.
df.drop( 'pop', axis = 1) ; df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5    Ohio  2000  3.2

- 열 이름 변경하기 : data.rename(columns = {before_name : after_name})

In [36]:
df.rename(columns = { 'pop' : 'pop1'}) ; df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5    Ohio  2000  3.2

In [37]:
# inplace = True 인자가 있어야 원본 데이터 변경
df.rename(columns = { 'pop' : 'pop1'} , inplace = True )  ; df

    state  year  pop1
0    Ohio  2000   1.5
1    Ohio  2001   1.7
2    Ohio  2002   3.6
3  Nevada  2001   2.4
4  Nevada  2002   2.9
5    Ohio  2000   3.2

- 열 이름 변경하기 : data.columns = [column1, column2 ...]

In [39]:
# 전부 다 바꾸고 싶을 땐, list 형태로 넘겨줘도 되지만, list의 길이가 column의 개수와 같아야 한다.
df.columns = ['주','년도','pop'] ; df

        주    년도  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5    Ohio  2000  3.2

## Indexing

### 열 indexing

In [40]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Ohio'],
    'year': [2000, 2001, 2002, 2001, 2002, 2000],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
df = pd.DataFrame(data)  ; df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5    Ohio  2000  3.2

In [41]:
df.state  # 시리즈

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5      Ohio
Name: state, dtype: object

In [42]:
df['state'] # 시리즈

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5      Ohio
Name: state, dtype: object

In [ ]:
# 하나의 열은 데이터프레임으로 출력할 수 없나?

In [47]:
## 여러개의 열을 동시에 indexing [[]] 대괄호를 두개!!  
df[['state', 'pop']]  # 데이터 프레임

    state  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9
5    Ohio  3.2

In [48]:
df.filter(['state', 'year']) # filter 오직 열만 추출가능

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5    Ohio  2000

In [49]:
df.filter(like='s') # column명에 's'가 포함된 column추출

    state
0    Ohio
1    Ohio
2    Ohio
3  Nevada
4  Nevada
5    Ohio

In [ ]:
# cloumn명에 'a' 가 포함된 column 추출

### 행 indexing
<img src='http://drive.google.com/uc?export=view&id=1eyYiZP5xQr5M6IIw9lnKjoAYY1m4YmiI'>

#### loc, iloc

- loc은 이름으로 뽑음
- iloc은 위치로 뽑음 (인덱스값)

In [51]:
df2 = pd.DataFrame({
    "name" : ['정하','민정','현준','광열','승수','민석'],
    "age" : [22, 22, 26, 22, 21, 23],
    "year" : [2016, 2017, 2018, 2019, 2019, 2017],
    "points" : [1.5, 1.7, 2.0, 3.8, 1.9, 2.3] 
})
df2

  name  age  year  points
0   정하   22  2016     1.5
1   민정   22  2017     1.7
2   현준   26  2018     2.0
3   광열   22  2019     3.8
4   승수   21  2019     1.9
5   민석   23  2017     2.3

- .iloc[ 행 , 열 ] 그동안 해왔던 슬라이싱과 동일하게 생각하면 편함

In [52]:
## iloc - 행 번호 (0 부터) 기준
df2.iloc[1:3]  # 인덱싱번호가 1부터 2까지인 행 추출

  name  age  year  points
1   민정   22  2017     1.7
2   현준   26  2018     2.0

In [53]:
df2.iloc[3]  # 인덱싱번호가 3인 행 추출

name        광열
age         22
year      2019
points     3.8
Name: 3, dtype: object

In [54]:
df2.iloc[1:3,0:3]  # 인덱싱번호가 1부터 2까지인 행에서 첫번째부터 세번째 열까지 추출

  name  age  year
1   민정   22  2017
2   현준   26  2018

In [55]:
df2.iloc[1:3,:] # 인덱싱번호가 1부터 2까지인 행의 모든 열

  name  age  year  points
1   민정   22  2017     1.7
2   현준   26  2018     2.0

In [63]:
df2.iloc[:,-4:-2] # -4부터 -3까지의 열에서 모든 행

  name  age
0   정하   22
1   민정   22
2   현준   26
3   광열   22
4   승수   21
5   민석   23

In [64]:
df2.iloc[:,-3:] # -3부터 모든 열에서 모든 행

   age  year  points
0   22  2016     1.5
1   22  2017     1.7
2   26  2018     2.0
3   22  2019     3.8
4   21  2019     1.9
5   23  2017     2.3

In [ ]:
# 행 : 0부터 4까지 2단위 , 열 : 모든 열

In [68]:
df2.iloc[[0,1,3],[1,3]] # 인덱싱번호 0,1,3인 행, 1,3인 열

   age  points
0   22     1.5
1   22     1.7
3   22     3.8

In [69]:
df2.iloc[1,2] # 인덱싱번호 1번 행, 2번 열에 해당하는 값

2017

- .loc[ 행 , 열 ] 인덱싱번호가 아닌 이름!으로 생각

In [72]:
## loc - 인덱스 (이름) 기준
df2.loc[1:3]  # 인덱스 이름이 1부터 3까지인 행의 모든 열

  name  age  year  points
1   민정   22  2017     1.7
2   현준   26  2018     2.0
3   광열   22  2019     3.8

In [ ]:
df2.loc[1:3,'name':'year'] # 인덱스 이름이 1부터 3까지인 행의 name 부터 year까지 열

In [73]:
df2.loc[:,['name','year']] # name과 year이라는 이름을 가진 열들의 모든 행

  name  year
0   정하  2016
1   민정  2017
2   현준  2018
3   광열  2019
4   승수  2019
5   민석  2017

In [74]:
df2.loc[1:3,:] # 인덱싱 번호가 1부터 3인 행의 모든 열

  name  age  year  points
1   민정   22  2017     1.7
2   현준   26  2018     2.0
3   광열   22  2019     3.8

In [75]:
df2.loc[0,'age'] # 인덱싱 번호 0, 열 이름이 age에 해당하는 값

22

In [76]:
df2.loc[:,:]

  name  age  year  points
0   정하   22  2016     1.5
1   민정   22  2017     1.7
2   현준   26  2018     2.0
3   광열   22  2019     3.8
4   승수   21  2019     1.9
5   민석   23  2017     2.3

#### boolean indexing

- 값이 참(True)과 거짓(False)으로 나타나는 데이터에서 True 값만 추출

In [81]:
df2['year'] > 2017

0    False
1    False
2     True
3     True
4     True
5    False
Name: year, dtype: bool

In [82]:
df2.loc[df2['year'] > 2017, :]  # year가 2017 초과인 행

  name  age  year  points
2   현준   26  2018     2.0
3   광열   22  2019     3.8
4   승수   21  2019     1.9

In [83]:
df2.loc[df2['age'] > df2['age'].mean(), ['name','age']] # age가 평균보다 큰 행에서 name, age 열

  name  age
2   현준   26
5   민석   23

In [ ]:
# 이름이 정하인 name, year 열 추출

In [84]:
## 조건이 여러개 일 때 
df2.loc[(df2['name'] == '정하') & (df2['points'] < 2), ['name','age','points']]  # and일 경우, &

  name  age  points
0   정하   22     1.5

In [85]:
df2.loc[(df2['name'] == '정하') | (df2['points'] < 2), ['name','age','points']]   # or일 경우, |

  name  age  points
0   정하   22     1.5
1   민정   22     1.7
4   승수   21     1.9

#### query

- boolean indexing의 가독성을 높인 것, 질의기능을 수행

In [86]:
df2.query('year > 2017')

  name  age  year  points
2   현준   26  2018     2.0
3   광열   22  2019     3.8
4   승수   21  2019     1.9

In [87]:
df2.query('age > age.mean()').filter(['name','age'])

  name  age
2   현준   26
5   민석   23

In [89]:
df2.query('name =="정하" and points < 2').filter(['name','age','points'])

  name  age  points
0   정하   22     1.5

In [ ]:
# 이름이 ['정하' ,'민정'] 리스트 안에 있는 행

## Merging DataFrame

<font color='darkgreen'>
##### Merge Types
<br><img align="left" src="http://drive.google.com/uc?export=view&id=1yEU_xZ9qZrZi8IIWTMhhMIKI95XxisX0" width=900 height=800>

In [91]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

display(df1,df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

  key  data2
0   a      0
1   b      1
2   d      2

In [92]:
pd.merge(df1, df2)  # how = 'inner'이 default

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [93]:
pd.merge(df1, df2, on='key')  # on = 'key' : key라는 열을 기준으로 merge

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [94]:
pd.merge(df1, df2, on='key', how='outer')  # how='outer' : 합집합

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [98]:
# 오른쪽의 df2가 기준이 되어 고정, 
# 왼쪽의 df1는 동일한 key값을 가질 때마다 달라 붙음, 없는 경우 NaN
pd.merge(df1, df2, on='key', how='right')

  key  data1  data2
0   b    0.0      1
1   b    1.0      1
2   b    6.0      1
3   a    2.0      0
4   a    4.0      0
5   a    5.0      0
6   d    NaN      2

- column명이 다른 경우

In [100]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

display(df3,df4)

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

  rkey  data2
0    a      0
1    b      1
2    d      2

In [103]:
# lkey 와 rkey가 기준열
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [104]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey' , how = 'outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

## Concatenating DataFrame

In [111]:
df5 = pd.DataFrame({'one' : range(0,5,2),
                    'two' : range(1,6,2)},
                  index=['a','b','c'])
df6 = pd.DataFrame({'three' : range(5,8,2),
                    'four' : range(6,9,2)},
                  index=['a','c'])
display(df5, df6)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      5     6
c      7     8

In [116]:
pd.concat([df5,df6]) # 행으로 추가

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    5.0   6.0
c  NaN  NaN    7.0   8.0

In [117]:
pd.concat([df5,df6], axis=1) # 열로 추가 : axis = 1 필요

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [118]:
pd.concat([df5,df6], ignore_index=True) ## 겹치는 index 무시하고 새로 부여

   one  two  three  four
0  0.0  1.0    NaN   NaN
1  2.0  3.0    NaN   NaN
2  4.0  5.0    NaN   NaN
3  NaN  NaN    5.0   6.0
4  NaN  NaN    7.0   8.0

## Handling Missing Data

In [120]:
data = pd.merge(df3, df4, left_on='lkey', right_on='rkey',how='outer')
data

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

- column별 / row별 결측값 개수 구하기

In [121]:
data.isnull()  # 결측값이 True로 반환
# pd.isnull(data)

    lkey  data1   rkey  data2
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False   True   True
7   True   True  False  False

In [123]:
## column별 개수
data.isnull().sum()
# pd.isnull(data).sum()

lkey     1
data1    1
rkey     1
data2    1
dtype: int64

In [ ]:
## row별 개수

In [126]:
data.notnull()   # 결측값이 False로 반환
# pd.notnull(data)

    lkey  data1   rkey  data2
0   True   True   True   True
1   True   True   True   True
2   True   True   True   True
3   True   True   True   True
4   True   True   True   True
5   True   True   True   True
6   True   True  False  False
7  False  False   True   True

In [127]:
## column별 개수
data.notnull().sum()
# pd.notnull(data).sum()

lkey     7
data1    7
rkey     7
data2    7
dtype: int64

In [128]:
## row별 개수
data.notnull().sum(1)
# pd.notnull(data).sum(1)

0    4
1    4
2    4
3    4
4    4
5    4
6    2
7    2
dtype: int64

- 결측값 채우기

In [129]:
data.fillna(0)

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0    0    0.0
7    0    0.0    d    2.0

In [130]:
data.fillna('missing')

      lkey    data1     rkey    data2
0        b        0        b        1
1        b        1        b        1
2        b        6        b        1
3        a        2        a        0
4        a        4        a        0
5        a        5        a        0
6        c        3  missing  missing
7  missing  missing        d        2

In [131]:
## 결측값을 앞 방향으로 채우기   # NaN 값을 위에 행 값으로 채워줌
data.fillna(method='ffill')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0    a    0.0
7    c    3.0    d    2.0

In [ ]:
## 결측값을 뒷 방향으로 채우기      # NaN 값을 아래 행 값으로 채워줌

In [133]:
## column별 평균으로 대체
data.fillna(data.mean())

  lkey  data1 rkey     data2
0    b    0.0    b  1.000000
1    b    1.0    b  1.000000
2    b    6.0    b  1.000000
3    a    2.0    a  0.000000
4    a    4.0    a  0.000000
5    a    5.0    a  0.000000
6    c    3.0  NaN  0.714286
7  NaN    3.0    d  2.000000

In [134]:
## column마다 다른 값으로 대체
data.fillna({'lkey':'ㅋ','data1':100,'rkey':'ㅋㅋ','data2':-100})

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0   ㅋㅋ -100.0
7    ㅋ  100.0    d    2.0

- 결측값이 들어있는 row / column 제거하기

In [141]:
data.dropna()

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0

In [137]:
data.dropna(axis=1)   # 열에 NaN값이 있으면 열 삭제

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [138]:
data.dropna(how='all')   # 모두 NaN 값일때 삭제

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [139]:
data.dropna(how='all', axis=1)  # 열에 있는 모든 값이 NaN일때 삭제

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

## Duplicate Rows

In [142]:
data = pd.DataFrame({
    'key1':['a', 'b', 'b', 'c', 'c'],
    'key2':['v', 'w', 'w', 'x', 'y'],
    'num':[1, 2, 2, 4, 5]
})
data

  key1 key2  num
0    a    v    1
1    b    w    2
2    b    w    2
3    c    x    4
4    c    y    5

.duplicated() : 중복되는 행이 있는지 확인 ( True, False 반환 )

In [143]:
data.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [144]:
data.duplicated(['key1'])   # 'key1' 열을 기준으로 중복확인

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [145]:
data.duplicated(['key1','key2'])# 'key1' , 'key2'열의 값이 모두 동일하면 True

0    False
1    False
2     True
3    False
4    False
dtype: bool

.drop_duplicates() : 중복제거

In [146]:
data.drop_duplicates()

  key1 key2  num
0    a    v    1
1    b    w    2
3    c    x    4
4    c    y    5

In [147]:
data.drop_duplicates(['key1']) # keep='first' default  기본적으로 아래 행이 지워짐.

  key1 key2  num
0    a    v    1
1    b    w    2
3    c    x    4

In [148]:
data.drop_duplicates(['key1'],keep='last')  # keep = 'last' 를 통해 위에 있던 행을 제거.

  key1 key2  num
0    a    v    1
2    b    w    2
4    c    y    5

In [ ]:
# 두개의 열을 기준으로 중복 제거

## Reading and Writing Data
<br>
<img align="left" src="http://drive.google.com/uc?export=view&id=1PQtlrD6iwmV9kp5uJrcSsLWpkYih9wGI" width=500 height=400>
###### 읽을때는 pd. 쓸때는 dataframe.

- 앞으로 우리가 다루게 될 데이터는 대부분 csv파일, xlsx파일, txt파일일 것이다.
- `csv파일`이란 (comma  separated values)이라는 뜻으로, 데이터가 콤마(,)로 구분된 파일이다.
- `xlsx파일`이란 우리가 흔히 저장하는 엑셀 파일이다.

- csv 파일을 불러올 때에는 `pd.read_csv()` 함수를 사용한다.
- 한글 데이터를 읽을 때 깨질 확률이 있는데, 이럴 때 `encoding = 'cp949`` 인자를 추가하면 된다.
```python
data = pd.read_csv('파일명', encoding = 'cp949')
```
- 데이터를 내보낼 때에는 `data.to_csv()` 메소드를 사용한다.
- 마찬가지로 한글 데이터를 잘 저장하기 위해서 `encoding = 'cp949'` 인자를 넣어주는 것이 좋다.
```python
data.to_csv('저장하고자 하는 파일명', encoding = 'cp949')
```

- excel 파일을 불러올 때에는 `pd.read_xlsx()` 함수를 사용한다.
- 마찬가지로 한글 데이터를 읽을 때엔 `encoding = 'cp949'` 인자를 넣어주자.
- excel 파일은 csv파일과 다르게 데이터 구분자를 모르기 때문에, 직접 구분자를 입력해 주어야 한다.
- 구분자는 `sep = ` 인자를 통해 설정해 주어야 한다.
```python
data = pd.read_excel('파일명', encoding = 'cp949', sep = '\t')
```
- 마찬가지로 데이터를 내보낼 때에는 다음과 같이 한다.
```python
data.to_excel('파일명', encoding = 'cp949', sep = '\t')
```

In [155]:
titanic = pd.read_csv('titanic.csv', encoding='cp949') ; titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [156]:
# index_col = 0 첫번째 열을 인덱스로
titanic2 = pd.read_csv('titanic.csv', encoding='cp949', index_col=0) ; titanic2.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- 데이터 내보내고 읽어오기

In [157]:
data = { 
    'name' : ['김정하','마민정','이현준','유광열'],
    'age' : [ 22, 22, 22, 22],
    'num' : [1, 2, 3, 4]}

example = pd.DataFrame(data) ; example

  name  age  num
0  김정하   22    1
1  마민정   22    2
2  이현준   22    3
3  유광열   22    4

In [158]:
example.to_excel('example.xlsx')

In [159]:
example = pd.read_excel('example.xlsx') ; example

   Unnamed: 0 name  age  num
0           0  김정하   22    1
1           1  마민정   22    2
2           2  이현준   22    3
3           3  유광열   22    4

In [160]:
example.to_excel('example1.xlsx', index = False)  # 인덱스를 내보내지 않음.

In [161]:
example1 = pd.read_excel('example1.xlsx') ; example1

   Unnamed: 0 name  age  num
0           0  김정하   22    1
1           1  마민정   22    2
2           2  이현준   22    3
3           3  유광열   22    4

### Exercise

In [163]:
import pandas as pd
titanic = pd.read_csv('titanic.csv', encoding='cp949') ; titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

**Q1.** 열 이름을 Survived에서 "생존여부"로 변경하시오.

In [ ]:
# code here

**Q2.** Age의 결측값을 35로 채우시오.

In [ ]:
# code here

**Q3.** loc을 사용하여 Embarked가 S인 데이터를 추출하시오.

In [ ]:
# code here

**Q3.** Fare를 기준으로 데이터를 정렬(내림차순)한 후, query를 사용하여 Fare가 평균 이상인 Name을 구하시오.

In [ ]:
# code here